In [1]:
import pandas as pd
import sklearn
from sklearn.model_selection import train_test_split

In [2]:
df_titanic = pd.read_csv("Datasets/train.csv")

In [3]:
df_titanic.shape

(891, 12)

In [4]:
df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# Cast categorical features to categorical
df_titanic['Survived'] = pd.Categorical(df_titanic.Survived)
df_titanic['Pclass'] = pd.Categorical(df_titanic.Pclass)
df_titanic['Embarked'] = pd.Categorical(df_titanic.Embarked)

In [6]:
df_titanic.drop(columns=['PassengerId', 'Name', 'Ticket', 'Cabin'], inplace = True)

In [7]:
df_titanic['Age'].fillna((df_titanic['Age'].median()), inplace=True)

In [8]:
df_titanic = pd.get_dummies(data=df_titanic, columns=['Sex', 'Embarked', 'Pclass'])

In [9]:
df_titanic.head()

,Survived,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3
0,0,22.0,1,0,7.2500,0,1,0,0,1,0,0,1
1,1,38.0,1,0,71.2833,1,0,1,0,0,1,0,0
2,1,26.0,0,0,7.9250,1,0,0,0,1,0,0,1
3,1,35.0,1,0,53.1000,1,0,0,0,1,1,0,0
4,0,35.0,0,0,8.0500,0,1,0,0,1,0,0,1

In [10]:
X = df_titanic.drop('Survived', axis =1)
Y = df_titanic['Survived']

x_train, x_test, y_train, y_test = train_test_split (X, Y, test_size =0.3, random_state =0)

In [11]:
x_train.shape, y_train.shape

((623, 12), (623,))

In [12]:
x_test.shape, y_test.shape

((268, 12), (268,))

In [13]:
from sklearn.tree import DecisionTreeClassifier

model = DecisionTreeClassifier(min_samples_leaf=50)
model.fit(x_train,y_train)

DecisionTreeClassifier(min_samples_leaf=50)

In [14]:
y_pred = model.predict(x_test)

In [15]:
from sklearn import metrics

accuracy = metrics.accuracy_score(y_test, y_pred)
print(accuracy)

0.7873134328358209

In [16]:
df_test = pd.read_csv("Datasets/test.csv")

In [17]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [18]:
df_test.drop(columns=['PassengerId','Name', 'Ticket', 'Cabin'], inplace = True)

In [19]:
df_test = pd.get_dummies(data=df_test, columns=['Sex', 'Embarked','Pclass'])

In [20]:
df_test.head()

,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3
0,34.5,0,0,7.8292,0,1,0,1,0,0,0,1
1,47.0,1,0,7.0000,1,0,0,0,1,0,0,1
2,62.0,0,0,9.6875,0,1,0,1,0,0,1,0
3,27.0,0,0,8.6625,0,1,0,0,1,0,0,1
4,22.0,1,1,12.2875,1,0,0,0,1,0,0,1

In [21]:
df_test.describe()

,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3
count,332.000000,418.000000,418.000000,417.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000,418.000000
mean,30.272590,0.447368,0.392344,35.627188,0.363636,0.636364,0.244019,0.110048,0.645933,0.255981,0.222488,0.521531
std,14.181209,0.896760,0.981429,55.907576,0.481622,0.481622,0.430019,0.313324,0.478803,0.436934,0.416416,0.500135
min,0.170000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,21.000000,0.000000,0.000000,7.895800,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,27.000000,0.000000,0.000000,14.454200,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,0.000000,1.000000
75%,39.000000,1.000000,0.000000,31.500000,1.000000,1.000000,0.000000,0.000000,1.000000,1.000000,0.000000,1.000000
max,76.000000,8.000000,9.000000,512.329200,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [22]:
print(df_test['Age'].isna().sum())

86

In [23]:
print(df_test['Age'].isna().sum())

86

In [24]:
df_test.columns[df_test.isnull().any()]

Index(['Age', 'Fare'], dtype='object')

In [25]:
df_test['Fare'].fillna((df_test['Fare'].median()), inplace=True)

In [26]:
df_test['Age'].fillna((df_test['Age'].median()), inplace=True)

In [27]:
pred = model.predict(df_test)

In [28]:
pd.DataFrame(pred).to_csv("/Users/remyabalakrishnan/Downloads/test_4.csv")

In [29]:
df_pred = pd.DataFrame(pred)

In [30]:
df_pred.shape

(418, 1)

In [31]:
df_test.shape

(418, 12)

In [32]:
df_pred.head()

   0
0  0
1  1
2  0
3  0
4  1

In [33]:
df_pred.shape

(418, 1)